<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"1703d58c8bb7b64722ca63ce11c61bf787ea4cf508e4071e70a24fd95c547668","plan_job_ref":"Job Create Terraform plan (DEV) #169 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15198188993","plan_out_hash":"e393272a15194260503ced4f2a78279c02a1206f1d44c65d8c467b4c7cb878be","plan_hash":"9d78f7c0187f8322d83e38413a23e9a078673e1eb68a19a7c8607288d4979ae2","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 4 to add, 1 to change, 4 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # helm_release.oauth2_proxy is tainted, so must be replaced
-/+ resource "helm_release" "oauth2_proxy" {
!~      id                         = "************" -> (known after apply)
+       manifest                   = (known after apply)
!~      metadata                   = [
-           {
-               app_version    = "7.9.0"
-               chart          = "oauth2-proxy"
-               first_deployed = 1747951454
-               last_deployed  = 1747951454
-               name           = "oauth2-proxy"
-               namespace      = "authgate"
-               notes          = <<-EOT
                    To verify that oauth2-proxy has started, run:
                    
                      kubectl --namespace=authgate get pods -l "app=oauth2-proxy"
                    
                    CHART NAME: redis
                    CHART VERSION: 21.0.0
                    APP VERSION: 8.0.0
                    
                    Did you know there are enterprise versions of the Bitnami catalog? For enhanced secure software supply chain features, unlimited pulls from Docker, LTS support, or application customization, see Bitnami Premium or Tanzu Application Catalog. See https://www.arrow.com/globalecs/na/vendors/bitnami for more information.
                    
                    ** Please be patient while the chart is being deployed **
                    
                    Redis&reg; can be accessed on the following DNS names from within your cluster:
                    
                        oauth2-proxy-redis-master.authgate.svc.cluster.local for read/write operations (port 6379)
                        oauth2-proxy-redis-replicas.authgate.svc.cluster.local for read-only operations (port 6379)
                    
                    
                    
                    To get your password run:
                    
                        export REDIS_PASSWORD=$(kubectl get secret --namespace authgate oauth2-proxy-redis -o jsonpath="{.data.redis-password}" | base64 -d)
                    
                    To connect to your Redis&reg; server:
                    
                    1. Run a Redis&reg; pod that you can use as a client:
                    
                       kubectl run --namespace authgate redis-client --restart='Never'  --env REDIS_PASSWORD=$REDIS_PASSWORD  --image docker.io/bitnami/redis:8.0.0-debian-12-r0 --command -- sleep infinity
                    
                       Use the following command to attach to the pod:
                    
                       kubectl exec --tty -i redis-client \
                       --namespace authgate -- bash
                    
                    2. Connect using the Redis&reg; CLI:
                       REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h oauth2-proxy-redis-master
                       REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h oauth2-proxy-redis-replicas
                    
                    To connect to your database from outside the cluster execute the following commands:
                    
                        kubectl port-forward --namespace authgate svc/oauth2-proxy-redis-master 6379:6379 &
                        REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h 127.0.0.1 -p 6379
                    
                    WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                      - replica.resources
                      - master.resources
                    +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                EOT
-               revision       = 1
-               values         = jsonencode(
                    {
-                       config             = {
-                           existingSecret = "oauth2-proxy-secret"
                        }
-                       extraArgs          = [
-                           "--provider=oidc",
-                           "--oidc-issuer-url=https://login.microsoftonline.com/8a25df97-9f2b-4ef1-a9e7-3faf585640e8/v2.0",
-                           "--scope=openid email profile",
-                           "--email-domain=*",
-                           "--redirect-url=https://oauth2.dev.audioprothese.ovh/oauth2/callback",
-                           "--skip-provider-button",
-                           "--reverse-proxy",
-                           "--cookie-secure=true",
-                           "--cookie-domain=.audioprothese.ovh",
-                           "--cookie-name=_oauth2_proxy",
-                           "--cookie-refresh=2m",
-                           "--cookie-expire=24h",
-                           "--whitelist-domain=.audioprothese.ovh",
-                           "--set-authorization-header=false",
-                           "--pass-access-token=false",
-                           "--pass-user-headers=true",
-                           "--set-xauthrequest=true",
-                           "--oidc-email-claim=preferred_username",
                        ]
-                       ingress            = {
-                           annotations = {
-                               "cert-manager.io/cluster-issuer"                 = "letsencrypt-prod"
-                               "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                            }
-                           className   = "webapprouting.kubernetes.azure.com"
-                           enabled     = true
-                           hosts       = [
-                               "oauth2.dev.audioprothese.ovh",
                            ]
-                           path        = "/oauth2"
-                           pathType    = "Prefix"
-                           tls         = [
-                               {
-                                   hosts      = [
-                                       "oauth2.dev.audioprothese.ovh",
                                    ]
-                                   secretName = "oauth2-tls"
                                },
                            ]
                        }
-                       initContainers     = {
-                           waitForRedis = {
-                               enabled = false
                            }
                        }
-                       proxyVarsAsSecrets = true
-                       redis              = {
-                           enabled = true
                        }
-                       service            = {
-                           portNumber = 4180
-                           type       = "ClusterIP"
                        }
-                       sessionStorage     = {
-                           redis = {
-                               clientType = "standalone"
-                               standalone = {
-                                   connectionUrl = "redis://oauth2-proxy-redis-master:6379/0"
                                }
                            }
-                           type  = "redis"
                        }
                    }
                )
-               version        = "7.12.13"
            },
        ] -> (known after apply)
        name                       = "oauth2-proxy"
!~      status                     = "failed" -> "deployed"
#        (26 unchanged attributes hidden)
    }

  # kubectl_manifest.externalsecret must be replaced
-/+ resource "kubectl_manifest" "externalsecret" {
!~      id                      = "************************************************************************************" -> (known after apply)
!~      live_manifest_incluster = (sensitive value)
!~      live_uid                = "a583459a-625a-439a-a0c0-e869f352dc71" -> (known after apply)
        name                    = "oauth2-proxy-secret"
!~      namespace               = "authgate" -> "eso" # forces replacement
!~      uid                     = "a583459a-625a-439a-a0c0-e869f352dc71" -> (known after apply)
!~      yaml_body               = (sensitive value)
!~      yaml_body_parsed        = <<-EOT
            apiVersion: external-secrets.io/v1
            kind: ExternalSecret
            metadata:
              name: oauth2-proxy-secret
          -   namespace: authgate
          +   namespace: eso
            spec:
              data:
              - remoteRef:
                  key: oauth2-proxy-client-id
                secretKey: client-id
              - remoteRef:
                  key: oauth2-proxy-client-secret
                secretKey: client-secret
              - remoteRef:
                  key: oauth2-proxy-cookie-secret
                secretKey: cookie-secret
              refreshInterval: 1h
              refreshPolicy: Periodic
              secretStoreRef:
                kind: SecretStore
                name: azure-secret-store
              target:
                creationPolicy: Owner
                name: oauth2-proxy-secret
          +     namespace: authgate
        EOT
!~      yaml_incluster          = (sensitive value)
#        (8 unchanged attributes hidden)
    }

  # kubectl_manifest.sa must be replaced
-/+ resource "kubectl_manifest" "sa" {
!~      id                      = "****************************************************************" -> (known after apply)
!~      live_manifest_incluster = (sensitive value)
!~      live_uid                = "6867cf97-bb24-41f5-a672-7ef8e56aebb0" -> (known after apply)
        name                    = "workload-identity-sa"
!~      namespace               = "authgate" -> "eso" # forces replacement
!~      uid                     = "6867cf97-bb24-41f5-a672-7ef8e56aebb0" -> (known after apply)
!~      yaml_body               = (sensitive value)
!~      yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: ServiceAccount
            metadata:
              annotations:
                azure.workload.identity/client-id: 05d382b8-48ff-4cb3-ad7e-3b7e81cd2e10
              name: workload-identity-sa
          -   namespace: authgate
          +   namespace: eso
        EOT
!~      yaml_incluster          = (sensitive value)
#        (8 unchanged attributes hidden)
    }

  # kubectl_manifest.secretstore must be replaced
-/+ resource "kubectl_manifest" "secretstore" {
!~      id                      = "********************************************************************************" -> (known after apply)
!~      live_manifest_incluster = (sensitive value)
!~      live_uid                = "b8f5048b-dab0-4fb9-8453-b80ee673eb71" -> (known after apply)
        name                    = "azure-secret-store"
!~      namespace               = "authgate" -> "eso" # forces replacement
!~      uid                     = "b8f5048b-dab0-4fb9-8453-b80ee673eb71" -> (known after apply)
!~      yaml_body               = (sensitive value)
!~      yaml_body_parsed        = <<-EOT
            apiVersion: external-secrets.io/v1
            kind: SecretStore
            metadata:
              name: azure-secret-store
          -   namespace: authgate
          +   namespace: eso
            spec:
              provider:
                azurekv:
                  authType: WorkloadIdentity
                  serviceAccountRef:
                    name: workload-identity-sa
                  tenantId: b7b023b8-7c32-4c02-92a6-c8cdaa1d189c
                  vaultUrl: https://openmrs-dev-vault.vault.azure.net/
        EOT
!~      yaml_incluster          = (sensitive value)
#        (8 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #169](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15198188993)